; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v4 ?v12)
             (pred_11 ?v8 ?v2)
             (pred_2 ?v4 ?v2)
             (pred_7 ?v5 ?v4 )
	     (pred_12 ?v4)
             (pred_1 ?v13)
             (pred_6 ?v8)
             (pred_9 ?v2)
             (pred_10 ?v4)
             (pred_3 ?v8)
             (pred_4 ?v4)
             (pred_8 ))



(:action op_4
:parameters (?v7 ?v1 ?v3 ?v10)
:precondition (and (pred_1 ?v7) (pred_1 ?v1) (pred_6 ?v3) (pred_9 ?v10)
          (pred_5 ?v7 ?v1) (pred_11 ?v3 ?v10)
                   (pred_2 ?v1 ?v10) (pred_12 ?v7) 
                   (pred_10 ?v1) (pred_3 ?v3))
:effect (and  (pred_4 ?v1) (not (pred_10 ?v1))))


(:action op_1
:parameters (?v7 ?v11)
:precondition (and (pred_1 ?v7) (pred_1 ?v11)
               (pred_12 ?v7) (pred_5 ?v7 ?v11) (pred_4 ?v11))
:effect (and (pred_12 ?v11) (not (pred_12 ?v7))))

(:action op_5
:parameters (?v7 ?v3)
:precondition (and (pred_1 ?v7) (pred_6 ?v3) 
                  (pred_12 ?v7) (pred_7 ?v3 ?v7) (pred_8 ))
:effect (and (pred_3 ?v3)
   (not (pred_7 ?v3 ?v7)) (not (pred_8 ))))


(:action op_3
:parameters (?v7 ?v9 ?v6)
:precondition (and (pred_1 ?v7) (pred_6 ?v9) (pred_6 ?v6)
                  (pred_12 ?v7) (pred_3 ?v6) (pred_7 ?v9 ?v7))
:effect (and (pred_3 ?v9) (pred_7 ?v6 ?v7)
        (not (pred_3 ?v6)) (not (pred_7 ?v9 ?v7))))

(:action op_2
:parameters (?v7 ?v3)
:precondition (and (pred_1 ?v7) (pred_6 ?v3) 
                  (pred_12 ?v7) (pred_3 ?v3))
:effect (and (pred_8 ) (pred_7 ?v3 ?v7) (not (pred_3 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_27 obj_09 obj_31 obj_24 obj_28 obj_05 obj_16 obj_01 obj_17 obj_18 obj_19 obj_12 obj_02 obj_03 obj_13 obj_29 obj_10 obj_20 obj_08 obj_06 obj_21 obj_26 obj_04 obj_14 obj_11
    obj_07 obj_23 obj_25
    obj_30 obj_15 obj_22
    )

    (:init
       (pred_8)

       (pred_1 obj_27)
       (pred_1 obj_09)
       (pred_1 obj_31)
       (pred_1 obj_24)
       (pred_1 obj_28)
       (pred_1 obj_05)
       (pred_1 obj_16)
       (pred_1 obj_01)
       (pred_1 obj_17)
       (pred_1 obj_18)
       (pred_1 obj_19)
       (pred_1 obj_12)
       (pred_1 obj_02)
       (pred_1 obj_03)
       (pred_1 obj_13)
       (pred_1 obj_29)
       (pred_1 obj_10)
       (pred_1 obj_20)
       (pred_1 obj_08)
       (pred_1 obj_06)
       (pred_1 obj_21)
       (pred_1 obj_26)
       (pred_1 obj_04)
       (pred_1 obj_14)
       (pred_1 obj_11)
       (pred_9 obj_07)
       (pred_9 obj_23)
       (pred_9 obj_25)
       (pred_6 obj_30)
       (pred_6 obj_15)
       (pred_6 obj_22)

       (pred_5 obj_27 obj_05)
       (pred_5 obj_27 obj_09)
       (pred_5 obj_09 obj_16)
       (pred_5 obj_09 obj_31)
       (pred_5 obj_09 obj_27)
       (pred_5 obj_31 obj_01)
       (pred_5 obj_31 obj_24)
       (pred_5 obj_31 obj_09)
       (pred_5 obj_24 obj_17)
       (pred_5 obj_24 obj_28)
       (pred_5 obj_24 obj_31)
       (pred_5 obj_28 obj_18)
       (pred_5 obj_28 obj_24)
       (pred_5 obj_05 obj_19)
       (pred_5 obj_05 obj_16)
       (pred_5 obj_05 obj_27)
       (pred_5 obj_16 obj_12)
       (pred_5 obj_16 obj_01)
       (pred_5 obj_16 obj_09)
       (pred_5 obj_16 obj_05)
       (pred_5 obj_01 obj_02)
       (pred_5 obj_01 obj_17)
       (pred_5 obj_01 obj_31)
       (pred_5 obj_01 obj_16)
       (pred_5 obj_17 obj_03)
       (pred_5 obj_17 obj_18)
       (pred_5 obj_17 obj_24)
       (pred_5 obj_17 obj_01)
       (pred_5 obj_18 obj_13)
       (pred_5 obj_18 obj_28)
       (pred_5 obj_18 obj_17)
       (pred_5 obj_19 obj_29)
       (pred_5 obj_19 obj_12)
       (pred_5 obj_19 obj_05)
       (pred_5 obj_12 obj_10)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_12 obj_16)
       (pred_5 obj_12 obj_19)
       (pred_5 obj_02 obj_20)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_02 obj_01)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_03 obj_08)
       (pred_5 obj_03 obj_13)
       (pred_5 obj_03 obj_17)
       (pred_5 obj_03 obj_02)
       (pred_5 obj_13 obj_06)
       (pred_5 obj_13 obj_18)
       (pred_5 obj_13 obj_03)
       (pred_5 obj_29 obj_21)
       (pred_5 obj_29 obj_10)
       (pred_5 obj_29 obj_19)
       (pred_5 obj_10 obj_26)
       (pred_5 obj_10 obj_20)
       (pred_5 obj_10 obj_12)
       (pred_5 obj_10 obj_29)
       (pred_5 obj_20 obj_04)
       (pred_5 obj_20 obj_08)
       (pred_5 obj_20 obj_02)
       (pred_5 obj_20 obj_10)
       (pred_5 obj_08 obj_14)
       (pred_5 obj_08 obj_06)
       (pred_5 obj_08 obj_03)
       (pred_5 obj_08 obj_20)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_13)
       (pred_5 obj_06 obj_08)
       (pred_5 obj_21 obj_26)
       (pred_5 obj_21 obj_29)
       (pred_5 obj_26 obj_04)
       (pred_5 obj_26 obj_10)
       (pred_5 obj_26 obj_21)
       (pred_5 obj_04 obj_14)
       (pred_5 obj_04 obj_20)
       (pred_5 obj_04 obj_26)
       (pred_5 obj_14 obj_11)
       (pred_5 obj_14 obj_08)
       (pred_5 obj_14 obj_04)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_11 obj_14)
       (pred_10 obj_28)
       (pred_10 obj_04)
       (pred_10 obj_12)
       (pred_2  obj_28 obj_07)
       (pred_2  obj_04 obj_23)
       (pred_2  obj_12 obj_25)
       (pred_4 obj_27)
       (pred_4 obj_09)
       (pred_4 obj_31)
       (pred_4 obj_24)
       (pred_4 obj_05)
       (pred_4 obj_16)
       (pred_4 obj_01)
       (pred_4 obj_17)
       (pred_4 obj_18)
       (pred_4 obj_19)
       (pred_4 obj_02)
       (pred_4 obj_03)
       (pred_4 obj_13)
       (pred_4 obj_29)
       (pred_4 obj_10)
       (pred_4 obj_20)
       (pred_4 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_21)
       (pred_4 obj_26)
       (pred_4 obj_14)
       (pred_4 obj_11)

       (pred_11  obj_30 obj_07)
       (pred_11  obj_15 obj_23)
       (pred_11  obj_22 obj_25)
       (pred_7 obj_30 obj_05)
       (pred_7 obj_15 obj_29)
       (pred_7 obj_22 obj_26)
       (pred_12 obj_21)
    )

    (:goal (and
       (pred_7 obj_22 obj_09)
    ))
(:constraints
  (always (not (pred_12 obj_10)))
)
)

; plan
1. (op_1 obj_21 obj_26)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_26)
   goals met: 0 of 1
2. (op_5 obj_26 obj_22)
   deleted: (pred_7 obj_22 obj_26) (pred_8)
   added: (pred_3 obj_22)
   goals met: 0 of 1
3. (op_1 obj_26 obj_21)
   deleted: (pred_12 obj_26)
   added: (pred_12 obj_21)
   goals met: 0 of 1
4. (op_1 obj_21 obj_29)
   deleted: (pred_12 obj_21)
   added: (pred_12 obj_29)
   goals met: 0 of 1
5. (op_1 obj_29 obj_19)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_19)
   goals met: 0 of 1
6. (op_1 obj_19 obj_05)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_05)
   goals met: 0 of 1
7. (op_1 obj_05 obj_27)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_27)
   goals met: 0 of 1
8. (op_1 obj_27 obj_09)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_09)
   goals met: 0 of 1
9. (op_2 obj_09 obj_22)
   deleted: (pred_3 obj_22)
   added: (pred_8) (pred_7 obj_22 obj_09)
   goals met: 1 of 1
